Documents/бит_УстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаИзменениеУслугПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СпособыРасчетаПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРасчетаПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикамСНаличиемИндивидуальных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребленияНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЖилойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИндивидуальнымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбщейПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтапливаемойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающимСНормативом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоСчетчикам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаИзменениеУслугПоЛС/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// БИТ_ЖКХ Возвращает булевое значение
//
// Параметры
//  НачальноеЗначение  – старое значение.
//
//  ВыбранноеЗначение  – текущее значение. 
//
// Возвращаемое значение:
//   Булево   – истина или ложь.
//
//
&НаКлиенте
Процедура ЗадатьВопросНаОчисткуТабЧасти(Знач Оповещение, НачальноеЗначение, ВыбранноеЗначение)
	
	Если НачальноеЗначение <> ВыбранноеЗначение Тогда
		
		Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
			
			Ответ = Неопределено;

			ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросНаОчисткуТабЧастиЗавершение", ЭтотОбъект, Новый Структура("Оповещение,ВыбранноеЗначение", Оповещение,ВыбранноеЗначение)), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
            Возврат;

		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список зданий " Тогда
			
			Объект.Здание = ВыбранноеЗначение;
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список улиц " Тогда
			
			Объект.Улица = ВыбранноеЗначение;
			Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Услуги ЖКХ " Тогда
			
			Объект.Услуга = ВыбранноеЗначение;
			
		КонецЕсли;
			
	КонецЕсли;
	
	ЗадатьВопросНаОчисткуТабЧастиФрагмент(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросНаОчисткуТабЧастиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
       
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        Объект.ЛицевыеСчета.Очистить();
		
		Если  Строка(Типзнч(ВыбранноеЗначение)) = "Список зданий " Тогда
			
			Объект.Здание = ВыбранноеЗначение;
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Список улиц " Тогда
			
			Объект.Улица = ВыбранноеЗначение;
			Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
		ИначеЕсли  Строка(Типзнч(ВыбранноеЗначение)) = "Услуги ЖКХ " Тогда
			
			Объект.Услуга = ВыбранноеЗначение;
			
		КонецЕсли;
		
    КонецЕсли;
    
    ЗадатьВопросНаОчисткуТабЧастиФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросНаОчисткуТабЧастиФрагмент(Знач Оповещение)
    
    ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

// Процедура открывает форму выбора элемента справочника бит_УслугиЖКХ.
// Параметры:
//	Элемент - поле ввода, для которого обрабатывается событие "НачалоВыбора".
//	СтандартнаяОбработка - флаг, указывающий будет ли выполнятся стандартная обработка события.
&НаКлиенте
Процедура ОткрытьФормуВыбораУслуги(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокУслуг = ПолучитьСписокУслуг();
	
	Отбор = Новый Структура;
	
	Если НЕ СписокУслуг = Неопределено Тогда
		
		Отбор.Вставить("Ссылка", СписокУслуг);
		
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

// Процедура открывает форму выбора элемента справочника бит_ЛицевыеСчета.
// Параметры:
//	Элемент - поле ввода, для которого обрабатывается событие "НачалоВыбора".
//	СтандартнаяОбработка - флаг, указывающий будет ли выполнятся стандартная обработка события.
&НаКлиенте
Процедура ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Отбор.Вставить("УлицаЛицевогоСчета", Объект.Улица);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Отбор.Вставить("Здание"            , Объект.Здание);
		
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

// Процедура открывает форму выбора элемента справочника бит_ПоставщикиУслуг.
//
// Параметры:
//
//	Элемент              - поле ввода, для которого обрабатывается событие "НачалоВыбора".
//
//	СтандартнаяОбработка - флаг, указывающий будет ли выполнятся стандартная обработка события.
//
//  ТекущаяУслуга        - справочникссылка, ссылка хранящее значение поставщика.
//
&НаКлиенте
Процедура ОткрытьФормуВыбораПоставщика(Элемент, ТекущаяУслуга, СтандартнаяОбработка, ЗначениеЭлемента)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере2(ТекущаяУслуга);
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка",                  СписокПоставщиков);
	Отбор.Вставить("НачальноеЗначениеВыбора", ЗначениеЭлемента);
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаИзменениеУслугПоЛС", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРежимаПотребления(Элемент, Владелец, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(Объект.Услуга);
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Ссылка", СписокПоставщиков);
		
		ОткрытьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаИзменениеУслугПоЛС", Отбор), Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , мКэшЗначений.ВидОперации);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ЛицевойСчет.Видимость                 = (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет);
	Элементы.Декорация1.Видимость                  = Не (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет);
	Элементы.Услуга.Видимость 	                   = (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета);	
	Элементы.ЛицевыеСчетаЛицевойСчет.Видимость     = (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета);
	Элементы.ЛицевыеСчетаУслуга.Видимость 	       = (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет);	
	Элементы.Группа6.Видимость                     = (Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета);	
	Элементы.РежимПотребления.Видимость	           = (УказыватьОтдельно = 1);
	Элементы.Поставщик.Видимость 			       = (УказыватьОтдельно = 1);
	Элементы.СпособРасчета.Видимость 		       = (УказыватьОтдельно = 1);
	Элементы.КоличествоЕдиницПотребления.Видимость = (УказыватьОтдельно = 1) и ((СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления) Или (СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет));
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет Тогда
		
		Элементы.ЛицевыеСчетаАктуальнымиУслугами.Видимость = Истина;
		Элементы.ЛицевыеСчетаЗаполнить.Видимость           = Ложь;
		Элементы.ЛицевыеСчетаПодбор.Видимость              = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета Тогда
		
		Элементы.ЛицевыеСчетаАктуальнымиУслугами.Видимость = Ложь;
		Элементы.ЛицевыеСчетаЗаполнить.Видимость           = Истина;
		Элементы.ЛицевыеСчетаПодбор.Видимость              = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, ДокументОбъект, ЭтаФорма);
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаСписокЗданий") Тогда
		
		Объект.ВидОперации = Параметры.ЗаполнитьИзСправочникаСписокЗданий.ВидОперации;
		Объект.Здание      = Параметры.ЗаполнитьИзСправочникаСписокЗданий.Здание;
		Объект.Улица       = Параметры.ЗаполнитьИзСправочникаСписокЗданий.Улица;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		ЗаполнитьПоследнимиЗначениямиНаСервере();
		
		Если Объект.ЛицевыеСчета.Количество() = 0 Тогда
			
			Объект.ЛицевыеСчета.Загрузить(бит_ОбщегоНазначения.ПолучитьШаблонУслугПоАдресу(ТекущаяДата(), Объект.Улица, Объект.Здание));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	АктивизироватьРеквизитВФормеНаСервере();
	
	УстановитьЗаголовокФормыДокумента();
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:58:53 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:58:53 Конец правки.
	
	Оповестить("ИзменениеУслугПоЛС", Объект.ЛицевойСчет, ТипЗнч(Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если УказыватьОтдельно = 1 Тогда
		
		ЗагрузитьЛицевыеСчетаНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая" Тогда
		
		ОбработкаВыбораНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура АктуальнымиУслугами(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("АктуальнымиУслугамиЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	АктуальнымиУслугамиФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура АктуальнымиУслугамиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Очистить();
	
	
	АктуальнымиУслугамиФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальнымиУслугамиФрагмент()
	
	ЗаполнитьПоследнимиЗначениямиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Очистить();
	
	ЗаполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент()
	
	ЗаполнитьЛицевымиСчетамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Услуга) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите услугу.");
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		ПараметрыФормы.Вставить("Здание"     , Объект.Здание);
		ПараметрыФормы.Вставить("Организация", ПолучитьОрганизациюЗданияНаСервере(Объект.Здание));
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		ПараметрыФормы.Вставить("Улица", Объект.Улица);
		
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ПредыдущийВидОперации = мКэшЗначений.ВидОперации; // Сохраним пред видОперациия для его сравнения с новым.
	
	// Если операция не поменялась то выходим.
	Если ПредыдущийВидОперации = Объект.ВидОперации Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Очистить();
	
	Объект.ЛицевойСчет = Неопределено;
	Объект.Услуга      = Неопределено;
	
	мКэшЗначений.ВидОперации = Объект.ВидОперации;
	
	// Отобразить в заголовке формы вид операции.
	УстановитьЗаголовокФормыДокумента();
	
	// Установить видимость реквизитов по виду операции.
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Если ПолучитьУлицуЗданияНаСервере(Объект.Здание) <> объект.Улица Тогда
		
		Объект.Здание      = Неопределено;
		Объект.ЛицевойСчет = Неопределено;
		Объект.Услуга      = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Новый ОписаниеОповещения("УлицаОбработкаВыбораЗавершение", ЭтотОбъект), Объект.Улица, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Завершение = Истина; 

КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораУслуги(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Новый ОписаниеОповещения("УслугаОбработкаВыбораЗавершение", ЭтотОбъект), Объект.Услуга, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Завершение = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Объект.Улица       = ПолучитьУлицуЗданияНаСервере(Объект.Здание);
		Объект.ЛицевойСчет = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Улица", Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор, ТекущаяСтрока, ПараметрВыборГруппИЭлементов", Отбор, Объект.Здание, Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Новый ОписаниеОповещения("ЗданиеОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)), Объект.Здание, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
    
    
    Если ЗначениеЗаполнено(Объект.Услуга) И ПроверитьУслугуНаЗдании(КонецДня(Объект.Дата), ВыбранноеЗначение, Объект.Услуга) Тогда
        
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуга :" + Объект.Услуга + """ не подключена по адресу: ул. " + ПолучитьУлицуЗданияНаСервере(ВыбранноеЗначение) + ", д." + ВыбранноеЗначение + ".");
        Объект.Услуга = Неопределено;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Объект.Улица = ПолучитьУлицаЛицевогоСчетаЛицевогоСчетаНаСервере(Объект.ЛицевойСчет);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Объект.Здание = ПолучитьЗданиеЛицевогоСчетаНаСервере(Объект.ЛицевойСчет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УказыватьОтдельноПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПотребленияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(РежимПотребления) Тогда
		
		РежимПотребления = мКэшЗначений.мРежимПотребления;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораРежимаПотребления(Элемент, Объект.Услуга, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПотребленияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мКэшЗначений.мРежимПотребления = РежимПотребления;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		
		Поставщик = мКэшЗначений.мПоставщик;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораПоставщика(Элемент, Объект.Услуга, СтандартнаяОбработка, Поставщик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мКэшЗначений.мПоставщик = Поставщик;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
	Если НЕ ЗначениеЗаполнено(СпособРасчета) Тогда
		
		СпособРасчета = мКэшЗначений.мСпособРасчета;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = СформироватьСписокВыбораСпособовРасчета(Объект.Услуга);
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СпособРасчетаНачалоВыбораЗавершение", ЭтотОбъект), СписокВыбора, Элементы.СпособРасчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        СпособРасчета = ВыбранныйЭлемент.Значение;
        
    КонецЕсли;
    
    УправлениеЭлементамиФормы();
    
    Если НЕ ЗначениеЗаполнено(СпособРасчета) Тогда
        
        СпособРасчета = мКэшЗначений.мСпособРасчета;
        
    КонецЕсли;
    
    мКэшЗначений.мСпособРасчета = СпособРасчета;

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мКэшЗначений.мСпособРасчета = СпособРасчета;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЛицевыеСчетаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления")
			Или ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам")
			Или ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет") Тогда
			
			Элементы.ЛицевыеСчетаКоличествоЕдиницПотребления.ТолькоПросмотр = Ложь;
			
		Иначе
			
			Элементы.ЛицевыеСчетаКоличествоЕдиницПотребления.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
		Если ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам")
			Или ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению") Тогда
			
			Элементы.ЛицевыеСчетаСпособРасчета.ТолькоПросмотр = Истина;
			
		Иначе
			
			Элементы.ЛицевыеСчетаСпособРасчета.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПриАктивизацииЯчейки(Элемент)
	
	ТекДанные = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "ЛицевыеСчетаКоличествоЕдиницПотребления" Тогда
		
		Если ТекДанные.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления") 
			Или ТекДанные.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам")
			Или ТекДанные.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет") Тогда
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
			
		Иначе
			
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НоваяСтрока 
		И Не Копирование Тогда
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета") Тогда
			
			РеквизитУслуга = Объект.Услуга;
			
		Иначе
			
			РеквизитУслуга = ТекущаяСтрока.Услуга;
			
		КонецЕсли;
		
		ТекущаяСтрока.РежимПотребления 	= ПолучитьОсновнойРежимПотребленияУслугиНаСервере(РеквизитУслуга);
		ТекущаяСтрока.СпособРасчета 	= ПолучитьОсновнойСпособРасчетаУслугиНаСервере(РеквизитУслуга);
		
		Если ТекущаяСтрока.НомерСтроки > 1 Тогда
			
			ТекущаяСтрока.Поставщик = ПолучитьПоставщикаЛицевогоСчетаНаСервере(ТекущаяСтрока.НомерСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаУслугаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	СведенияПоУслуге = ЗаполнитьСведенияПоУслуге(Объект.Дата,
	?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет"),
	Объект.ЛицевойСчет,
	ТекущаяСтрока.ЛицевойСчет),
	?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета"),
	Объект.Услуга,
	ТекущаяСтрока.Услуга));
	
	ТекущаяСтрока.РежимПотребления            = СведенияПоУслуге.РежимПотребления;
	ТекущаяСтрока.Поставщик                   = СведенияПоУслуге.Поставщик;
	ТекущаяСтрока.СпособРасчета               = СведенияПоУслуге.СпособРасчета;
	ТекущаяСтрока.КоличествоЕдиницПотребления = СведенияПоУслуге.КоличествоЕдиницПотребления;
	
	Элементы.ЛицевыеСчета.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораУслуги(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Услуга", ВыбранноеЗначение); 
	
	НайденнаяСтрока = Объект.ЛицевыеСчета.НайтиСтроки(Отбор);
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НайденнаяСтрока.Количество() > 0 
		И НайденнаяСтрока[0] <> ТекущаяСтрока Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выбранное значение уже подобрано!");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	СведенияПоУслуге = ЗаполнитьСведенияПоУслуге(Объект.Дата,
	?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет"),
	Объект.ЛицевойСчет,
	ТекущаяСтрока.ЛицевойСчет),
	?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета"),
	Объект.Услуга,
	ТекущаяСтрока.Услуга));
	
	ТекущаяСтрока.РежимПотребления            = СведенияПоУслуге.РежимПотребления;
	ТекущаяСтрока.Поставщик                   = СведенияПоУслуге.Поставщик;
	ТекущаяСтрока.СпособРасчета               = СведенияПоУслуге.СпособРасчета;
	ТекущаяСтрока.КоличествоЕдиницПотребления = СведенияПоУслуге.КоличествоЕдиницПотребления;
	
	Элементы.ЛицевыеСчета.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Услуга) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите услугу.");
				
		СтандартнаяОбработка = Ложь;
		
		Возврат;
		
	КонецЕсли; 
	
	ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ЛицевойСчет", ВыбранноеЗначение); 
	
	НайденнаяСтрока = Объект.ЛицевыеСчета.НайтиСтроки(Отбор);
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НайденнаяСтрока.Количество() > 0 
		И НайденнаяСтрока[0] <> ТекущаяСтрока Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
	Если ПроверитьУслугуНаЗдании(КонецДня(Объект.Дата), ПолучитьЗданиеЛицевогоСчетаНаСервере(ВыбранноеЗначение), Объект.Услуга) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуга :" + Объект.Услуга + " не подключена по адресу лицевого счета: " + ВыбранноеЗначение + " ул. " + ПолучитьУлицаЛицевогоСчетаЛицевогоСчетаНаСервере(ВыбранноеЗначение) + ", д." + ПолучитьЗданиеЛицевогоСчетаНаСервере(ВыбранноеЗначение));
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПоставщикПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Поставщик) Тогда
		
		ТекущаяСтрока.Поставщик = мКэшЗначений.мПоставщик;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета") Тогда
		
		РеквизитУслуга = Объект.Услуга;
		
	Иначе
		
		РеквизитУслуга = ТекущаяСтрока.Услуга;
		
	КонецЕсли;
	
	ОткрытьФормуВыбораПоставщика(Элемент, РеквизитУслуга, СтандартнаяОбработка, ТекущаяСтрока.Поставщик);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПоставщикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	мКэшЗначений.мПоставщик = ТекущаяСтрока.Поставщик;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаРежимПотребленияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.РежимПотребления) Тогда
		
		ТекущаяСтрока.РежимПотребления = мКэшЗначений.мРежимПотребления;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаРежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета") Тогда
		
		ТекущаяУслуга = объект.Услуга;
		
	Иначе
		
		ТекущаяУслуга = ТекСтрока.Услуга;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(ТекущаяУслуга);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ссылка", СписокПоставщиков);
	
	ОткрытьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаИзменениеУслугПоЛС, ТекущаяСтрока, ПараметрВыборГруппИЭлементов", ПараметрыФормы, ТекСтрока.РежимПотребления, Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаРежимПотребленияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	мКэшЗначений.мРежимПотребления = ТекущаяСтрока.РежимПотребления;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСпособРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Не (ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления")
		Или ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет")) Тогда
		
		ТекущаяСтрока.КоличествоЕдиницПотребления = 0;
		
	Иначе 
		
		СведенияПоУслуге = ЗаполнитьСведенияПоУслуге(Объект.Дата,
		?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет"),
		Объект.ЛицевойСчет,
		ТекущаяСтрока.ЛицевойСчет),
		?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета"),
		Объект.Услуга,
		ТекущаяСтрока.Услуга));
		
		ТекущаяСтрока.КоличествоЕдиницПотребления = СведенияПоУслуге.КоличествоЕдиницПотребления;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СпособРасчета) Тогда
		
		ТекущаяСтрока.СпособРасчета = мКэшЗначений.мСпособРасчета;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСпособРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета") Тогда
		
		РеквизитУслуга = Объект.Услуга;
		
	Иначе
		
		РеквизитУслуга = ТекущаяСтрока.Услуга;
		
	КонецЕсли;
	
	СписокВыбора = СформироватьСписокВыбораСпособовРасчета(РеквизитУслуга);
	
	// БИТ_ЖКХ 11.02.2015{{ избавление от модального вызова.
	// ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, Элементы.ЛицевыеСчетаСпособРасчета);.
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораКлиента", ЭтаФорма,ТекущаяСтрока);
	//СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Выберите элемент");
	// БИТ ЖКХ 23.03.2020
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКлиента(ВыбранныйЭлемент,ТекущаяСтрока) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ТекущаяСтрока.СпособРасчета = ВыбранныйЭлемент.Значение;
		
	КонецЕсли;
	
	Если Не (ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления")
		Или ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет")) Тогда
		
		ТекущаяСтрока.КоличествоЕдиницПотребления = 0;
		
	Иначе 
		
		СведенияПоУслуге = ЗаполнитьСведенияПоУслуге(Объект.Дата,
		?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет"),
		Объект.ЛицевойСчет,
		ТекущаяСтрока.ЛицевойСчет),
		?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета"),
		Объект.Услуга,
		ТекущаяСтрока.Услуга));
		
		ТекущаяСтрока.КоличествоЕдиницПотребления = СведенияПоУслуге.КоличествоЕдиницПотребления;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СпособРасчета) Тогда
		
		ТекущаяСтрока.СпособРасчета = мКэшЗначений.мСпособРасчета;
		
	КонецЕсли;
	
	мКэшЗначений.мСпособРасчета = ТекущаяСтрока.СпособРасчета;
	
КонецПроцедуры
// БИТ_ЖКХ 11.02.2015}}

&НаКлиенте
Процедура ЛицевыеСчетаСпособРасчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	мКэшЗначений.мСпособРасчета = ТекущаяСтрока.СпособРасчета;
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ввод по строке не доступен. Воспользуйтесь кнопкой выбора элемента.");
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// БИТ_ЖКХ Формирует список значений.
//
// Параметры
//  ТекущаяУслуга  – справочникссылка, содержит значение услуги.
//
// Возвращаемое значение:
//   СписокЗначений   – содержит список способов расчета.
//
//
Функция СформироватьСписокВыбораСпособовРасчета(ТекущаяУслуга)
	
	СписокЗначений = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из ТекущаяУслуга.СпособыРасчета Цикл
		
		Если ТекСтрока.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам 
			ИЛИ ТекСтрока.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СписокЗначений.Добавить(ТекСтрока.СпособРасчета);
		
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	КэшированныеЗначения.Вставить("ВидОперации"         , Объект.ВидОперации);
	КэшированныеЗначения.Вставить("мПоставщик"          , Справочники.бит_ПоставщикиУслуг.ПустаяСсылка());
	КэшированныеЗначения.Вставить("мРежимПотребления"   , Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
	КэшированныеЗначения.Вставить("мСпособРасчета"      , Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура АктивизироватьРеквизитВФормеНаСервере()
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("ЛицевойСчет");
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(ДокументОбъект, ЭтаФорма, СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоследнимиЗначениямиНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ЗаполнитьПоследнимиЗначениями();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛицевымиСчетамиНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ЗаполнитьЛицевымиСчетами();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизациюЗданияНаСервере(Знач Здание)
	
	Возврат Здание.Организация;
	
КонецФункции

&НаСервере
Функция ПолучитьУлицуЗданияНаСервере(Знач Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьУслугуНаЗдании(Знач Дата, Знач Здание, Знач Услуга)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Период,
	|			Здание = &Здание
	|				И Услуга = &Услуга) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции // ()

&НаСервере
Функция ПолучитьОсновнойРежимПотребленияУслугиНаСервере(Знач Услуга)
	
	Возврат Услуга.ОсновнойРежимПотребления;
	
КонецФункции

&НаСервере
Функция ПолучитьОсновнойСпособРасчетаУслугиНаСервере(Знач Услуга)
	
	Возврат Услуга.ОсновнойСпособРасчета;
	
КонецФункции

&НаСервере
Функция ПолучитьПоставщикаЛицевогоСчетаНаСервере(Знач НомерСтроки)
	
	Возврат Объект.ЛицевыеСчета.Получить(НомерСтроки - 2).Поставщик;
	
КонецФункции

&НаСервере
Функция ПолучитьЗданиеЛицевогоСчетаНаСервере(Знач ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание;
	
КонецФункции

&НаСервере
Функция ПолучитьУлицаЛицевогоСчетаЛицевогоСчетаНаСервере(Знач ЛицевойСчет)
	
	Возврат ЛицевойСчет.УлицаЛицевогоСчета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПоставщиковНаСервере(ТекущаяУслуга)
	
	СписокПоставщиков = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из ТекущаяУслуга.РежимыПотребленияУслуг Цикл
		
		СписокПоставщиков.Добавить(ТекСтрока.РежимПотребленияУслуг);
		
	КонецЦикла;
	
	Возврат СписокПоставщиков;
	
КонецФункции

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервереБезКонтекста
Функция ЗаполнитьСведенияПоУслуге(Знач Дата, Знач ЛицевойСчет, Знач Услуга)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сведения  = Новый Структура;	
	
	Если Выборка.Следующий() Тогда
		
		Сведения.Вставить("РежимПотребления",            Выборка.РежимПотребления);
		Сведения.Вставить("Поставщик",                   Выборка.Поставщик);
		Сведения.Вставить("СпособРасчета",               Выборка.СпособРасчета);
		Сведения.Вставить("КоличествоЕдиницПотребления", Выборка.КоличествоЕдиницПотребления);
		
	Иначе
		
		Сведения.Вставить("РежимПотребления",            Неопределено);
		Сведения.Вставить("Поставщик",                   Неопределено);
		Сведения.Вставить("СпособРасчета",               Неопределено);
		Сведения.Вставить("КоличествоЕдиницПотребления", Неопределено);
		
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции // () 

&НаСервере
Процедура ЗагрузитьЛицевыеСчетаНаСервере()
	
	ТЗ = Объект.ЛицевыеСчета.Выгрузить();
	
	Если ЗначениеЗаполнено(РежимПотребления) Тогда
		
		ТЗ.ЗаполнитьЗначения(РежимПотребления, "РежимПотребления");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		
		ТЗ.ЗаполнитьЗначения(Поставщик, "Поставщик");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпособРасчета) Тогда
		
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			
			Если Не СтрокаТЗ.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам Тогда
				
				СтрокаТЗ.СпособРасчета = СпособРасчета;
				
			КонецЕсли;
			
		КонецЦикла;				
		
		Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления 
			Или СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет Тогда
			
			ТЗ.ЗаполнитьЗначения(КоличествоЕдиницПотребления, "КоличествоЕдиницПотребления");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Загрузить(ТЗ);
	
КонецПроцедуры

Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка получения данных из временного хранилища. Выполните подбор заново.");
	Иначе	
		
		Для Каждого СтрокаТаблицы Из ТаблицаЛС Цикл
			
			ЛС =  СтрокаТаблицы.ЛицевойСчет;
			
			Если ПроверитьУслугуНаЗдании(КонецМесяца(Объект.Дата), ЛС.Здание, Объект.Услуга) Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Услуга :" + Объект.Услуга + " не подключена по адресу лицевого счета:"+ ЛС +", ул. "+ ЛС.УлицаЛицевогоСчета +", д."+ ЛС.Здание);
				Продолжить;
				
			КонецЕсли;
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ЛицевойСчет", ЛС);
			
			СтрокаПоиска = объект.ЛицевыеСчета.НайтиСтроки(Отбор);
			
			Если СтрокаПоиска.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
				
				НоваяСтрока.ЛицевойСчет = ЛС;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслуг()
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Улица,
	|	бит_ШаблоныУслугСрезПоследних.Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга,
	|	бит_ШаблоныУслугСрезПоследних.Поставщик
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(&Период, ) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	ПостроительЗапроса.Параметры.Вставить("Период", КонецДня(Объект.Дата));
	
	Если НЕ ЗначениеЗаполнено(Объект.Улица) И НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Улица");
		
		ПостроительЗапроса.Отбор.Улица.Установить(Объект.Улица, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Здание");
		
		ПостроительЗапроса.Отбор.Здание.Установить(Объект.Здание, Истина);
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Результат = ПостроительЗапроса.Результат.Выгрузить();
	
	Результат.Свернуть("Услуга");
	
	СписокУслуг = Новый СписокЗначений;
	
	СписокУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокУслуг;
	
КонецФункции // ()

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервереБезКонтекста 
Функция ПолучитьСписокПоставщиковНаСервере2(ТекущаяУслуга)
	
	СписокПоставщиков = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из ТекущаяУслуга.Поставщики Цикл
		
		СписокПоставщиков.Добавить(ТекСтрока.Поставщик);
		
	КонецЦикла;
	
	Возврат СписокПоставщиков;
	
КонецФункции

// Процедура для изменения в настройках(отдельно или ко всем).
&НаКлиенте
Процедура ЛицевыеСчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.УказыватьОтдельно = 1 Тогда
		
		ЭтаФорма.УказыватьОтдельно = 0;
		
	КонецЕсли;	
		 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОмскНаСервере()
	Счет = 0;
	Здание = Объект.Здание;
	Дата = Объект.Дата;
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Здание",Здание);
	Запрос.УстановитьПараметр("Дата",Дата);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Пока РезультатЗапроса.Количество() > Счет Цикл
		ЗапросСчет = РезультатЗапроса[Счет];
		НовСтрока = Объект.ЛицевыеСчета.Добавить();
	    НовСтрока.ЛицевойСчет    		      = ЗапросСчет.ЛицевойСчет;
	    НовСтрока.Услуга          			  = Объект.Услуга;
		НовСтрока.Поставщик       			  = Поставщик;
		НовСтрока.СпособРасчета   			  = СпособРасчета;
		НовСтрока.РежимПотребления 			  = РежимПотребления;
		НовСтрока.КоличествоЕдиницПотребления = ЗапросСчет.КоличествоЕдиницПотребления;
		Счет = Счет + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОмск(Команда)
	ЗаполнитьОмскНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса()
	Здание = Объект.Здание;
	Дата = Объект.Дата;
	Если СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади Тогда
		ТекстЗапросаЛС = "ВЫБРАТЬ
		                 |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		                 |	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК КоличествоЕдиницПотребления
		                 |ИЗ
		                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		                 |		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
		                 |		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		                 |ГДЕ
		                 |	бит_СписокЗданий.Ссылка = &Здание   
						 //++АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя
						 |	И НЕ бит_ЛицевыеСчета.Архивный";
	Иначе 
		ТекстЗапросаЛС = "ВЫБРАТЬ
		                 |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		                 |	0 КАК КоличествоЕдиницПотребления
		                 |ИЗ
		                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		                 |		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
		                 |		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		                 |ГДЕ
		                 |	бит_СписокЗданий.Ссылка = &Здание            
						 //++АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя
						 |	И НЕ бит_ЛицевыеСчета.Архивный";
	КонецЕсли;
	Возврат ТекстЗапросаЛС;
	
КонецФункции

#КонецОбласти
